luanxg/RTL8720-SDK/component/os/freertos/freertos_v8.1.2/Source/portable/MemMang/heap_5.c
/*
 * Inserts a block of memory that is being freed into the correct position in
 * the list of free memory blocks.  The block being freed will be merged with
 * the block in front it and/or the block behind it if the memory blocks are
 * adjacent to each other.
 */
static void prvInsertBlockIntoFreeList( BlockLink_t *pxBlockToInsert );

/*-----------------------------------------------------------*/

/* The size of the structure placed at the beginning of each allocated memory
block must by correctly byte aligned. */
static const uint32_t uxHeapStructSize	= ( ( sizeof ( BlockLink_t ) + ( portBYTE_ALIGNMENT - 1 ) ) & ~portBYTE_ALIGNMENT_MASK );

/* Create a couple of list links to mark the start and end of the list. */
static BlockLink_t xStart, *pxEnd = NULL;

/* Keeps track of the number of free bytes remaining, but says nothing about
fragmentation. */
static size_t xFreeBytesRemaining = 0;
static size_t xMinimumEverFreeBytesRemaining = 0;
#if defined CONFIG_PLATFORM_8195A
#define SRAM_START_ADDRESS   0x10000000
#define SDRAM_START_ADDRESS  0x30000000
static size_t xSRAMFreeBytesRemaining = 0;
static size_t xSDRAMFreeBytesRemaining = 0;
#endif

/* Gets set to the top bit of an size_t type.  When this bit in the xBlockSize
member of an BlockLink_t structure is set then the block belongs to the
application.  When the bit is free the block is still part of the free heap
space. */
static size_t xBlockAllocatedBit = 0;

/* Realtek test code start */
//TODO: remove section when combine BD and BF
#if ((defined CONFIG_PLATFORM_8195A) || (defined CONFIG_PLATFORM_8711B) || (defined CONFIG_PLATFORM_8721D))
#include "section_config.h"
SRAM_BF_DATA_SECTION
#endif
static unsigned char ucHeap[ configTOTAL_HEAP_SIZE ];

#if (defined CONFIG_PLATFORM_8195A)
HeapRegion_t xHeapRegions[] =
{
	{ (uint8_t*)0x10002300, 0x3D00 },	// Image1 recycle heap
	{ ucHeap, sizeof(ucHeap) }, 		// Defines a block from ucHeap
#if 0
	{ (uint8_t*)0x301b5000, 300*1024 }, // SDRAM heap
#endif        
	{ NULL, 0 } 							// Terminates the array.
};
#elif (defined CONFIG_PLATFORM_8711B)
#include "rtl8710b_boot.h"
extern BOOT_EXPORT_SYMB_TABLE boot_export_symbol;
HeapRegion_t xHeapRegions[] =
{
	{ 0, 0},	// Image1 reserved ,length will be corrected in pvPortMalloc()
	{ ucHeap, sizeof(ucHeap) }, 	// Defines a block from ucHeap
	{ 0, 0},	// RDP reserved, will be corrected in pvPortMalloc()
	{ NULL, 0 } 					// Terminates the array.
};
#elif (defined CONFIG_PLATFORM_8721D)
#include "rtl8721d_boot.h"
extern BOOT_EXPORT_SYMB_TABLE boot_export_symbol;
HeapRegion_t xHeapRegions[] =
{
#if defined (ARM_CORE_CM0)
	{ (uint8_t*)0x00080A00, 0x1600 },	// KM0 ROM BSS just used RAM befor 0x000809ce
#endif
	{ ucHeap, sizeof(ucHeap) }, 	// Defines a block from ucHeap
	//{ 0, 0},	// RDP reserved, will be corrected in pvPortMalloc()
	{ NULL, 0 } 					// Terminates the array.
};
#else
#error NOT SUPPORT CHIP
#endif
/* Realtek test code end */

/*-----------------------------------------------------------*/
#if 1
/*
	Dump xBlock list
*/
void dump_mem_block_list(void)
{
	BlockLink_t *pxBlock = &xStart;
	int count = 0;

	printf("\n===============================>Memory List:\n");
	while(pxBlock->pxNextFreeBlock != NULL)
	{
		printf("[%d]=0x%p, %d\n", count++, pxBlock, pxBlock->xBlockSize);
		pxBlock = pxBlock->pxNextFreeBlock;
	}
}
#endif

void *pvPortMalloc( size_t xWantedSize )
{
BlockLink_t *pxBlock, *pxPreviousBlock, *pxNewBlockLink;
void *pvReturn = NULL;

	/* Realtek test code start */
	if(pxEnd == NULL)
	{
#if (defined CONFIG_PLATFORM_8711B)
		xHeapRegions[ 0 ].xSizeInBytes = (uint32_t)((uint8_t*)0x10005000 - (uint8_t*)boot_export_symbol.boot_ram_end);
		xHeapRegions[ 0 ].pucStartAddress = (uint8_t*)boot_export_symbol.boot_ram_end;

		if(!IsRDPenabled()){
			xHeapRegions[ 2 ].xSizeInBytes = 0x1000;
			xHeapRegions[ 2 ].pucStartAddress = (uint8_t*)0x1003f000;
		}else{
			xHeapRegions[ 2 ].xSizeInBytes = 0;
			xHeapRegions[ 2 ].pucStartAddress = NULL;
		}
#endif		
		vPortDefineHeapRegions( xHeapRegions );
	}
	/* Realtek test code end */

	/* The heap must be initialised before the first call to
	prvPortMalloc(). */
	configASSERT( pxEnd );

	vTaskSuspendAll();
	{
		/* Check the requested block size is not so large that the top bit is
		set.  The top bit of the block size member of the BlockLink_t structure
		is used to determine who owns the block - the application or the
		kernel, so it must be free. */
		if( ( xWantedSize & xBlockAllocatedBit ) == 0 )
		{
			/* The wanted size is increased so it can contain a BlockLink_t
			structure in addition to the requested amount of bytes. */
			if( xWantedSize > 0 )
			{
				xWantedSize += uxHeapStructSize;

				/* Ensure that blocks are always aligned to the required number
				of bytes. */
				if( ( xWantedSize & portBYTE_ALIGNMENT_MASK ) != 0x00 )
				{
					/* Byte alignment required. */
					xWantedSize += ( portBYTE_ALIGNMENT - ( xWantedSize & portBYTE_ALIGNMENT_MASK ) );
				}
				else
				{
					mtCOVERAGE_TEST_MARKER();
				}
			}
			else
			{
				mtCOVERAGE_TEST_MARKER();
			}

			if( ( xWantedSize > 0 ) && ( xWantedSize <= xFreeBytesRemaining ) )
			{
				/* Traverse the list from the start	(lowest address) block until
				one	of adequate size is found. */
				pxPreviousBlock = &xStart;
				pxBlock = xStart.pxNextFreeBlock;
				while( ( pxBlock->xBlockSize < xWantedSize ) && ( pxBlock->pxNextFreeBlock != NULL ) )
				{
					pxPreviousBlock = pxBlock;
					pxBlock = pxBlock->pxNextFreeBlock;
				}

				/* If the end marker was reached then a block of adequate size
				was	not found. */
				if( pxBlock != pxEnd )
				{
					/* Return the memory space pointed to - jumping over the
					BlockLink_t structure at its start. */
					pvReturn = ( void * ) ( ( ( uint8_t * ) pxPreviousBlock->pxNextFreeBlock ) + uxHeapStructSize );

					/* This block is being returned for use so must be taken out
					of the list of free blocks. */
					pxPreviousBlock->pxNextFreeBlock = pxBlock->pxNextFreeBlock;

					/* If the block is larger than required it can be split into
					two. */
					if( ( pxBlock->xBlockSize - xWantedSize ) > heapMINIMUM_BLOCK_SIZE )
					{
						/* This block is to be split into two.  Create a new
						block following the number of bytes requested. The void
						cast is used to prevent byte alignment warnings from the
						compiler. */
						pxNewBlockLink = ( void * ) ( ( ( uint8_t * ) pxBlock ) + xWantedSize );

						/* Calculate the sizes of two blocks split from the
						single block. */
						pxNewBlockLink->xBlockSize = pxBlock->xBlockSize - xWantedSize;
						pxBlock->xBlockSize = xWantedSize;

						/* Insert the new block into the list of free blocks. */
						prvInsertBlockIntoFreeList( ( pxNewBlockLink ) );
					}
					else
					{
						mtCOVERAGE_TEST_MARKER();
					}

